### Terraform Plan: `dev/base`
```
Acquiring state lock. This may take a few moments...
data.aws_ami.nat_ubuntu: Reading...
module.networking.aws_vpc.main: Refreshing state... [id=vpc-0d77fef37669dc1c0]
module.networking.data.aws_ami.nat_amazon_linux: Reading...
module.networking.aws_eip.nat: Refreshing state... [id=eipalloc-062b606ffff92b459]
data.aws_ami.nat_ubuntu: Read complete after 1s [id=ami-05d7ff9706f910b7d]
module.networking.data.aws_ami.nat_amazon_linux: Read complete after 1s [id=ami-0ef865bea9cabdaee]
module.networking.aws_security_group.nat: Refreshing state... [id=sg-0a212a3070298e3e9]
module.networking.aws_internet_gateway.main: Refreshing state... [id=igw-00facfe2199af81fa]
module.networking.aws_subnet.this["private_app"]: Refreshing state... [id=subnet-07b63a3183c737d91]
module.networking.aws_route_table.private: Refreshing state... [id=rtb-007b1826a1715b5da]
module.networking.aws_subnet.this["private_db"]: Refreshing state... [id=subnet-0f71720fec2f14772]
module.networking.aws_subnet.this["public"]: Refreshing state... [id=subnet-05621a464006280c3]
module.networking.aws_route_table.public: Refreshing state... [id=rtb-0489ce78da442e378]
module.networking.aws_instance.nat: Refreshing state... [id=i-0e578444c61e7ceeb]
module.networking.aws_route_table_association.this["private_db"]: Refreshing state... [id=rtbassoc-0409653bd618d6166]
module.networking.aws_route_table_association.this["public"]: Refreshing state... [id=rtbassoc-0458d43542085b1d2]
module.networking.aws_route_table_association.this["private_app"]: Refreshing state... [id=rtbassoc-00336a3e79d14d1e5]
module.networking.aws_vpc_endpoint.s3: Refreshing state... [id=vpce-0b047ecb4ee9aed19]
module.networking.aws_eip_association.nat: Refreshing state... [id=eipassoc-03dc0ceb94f260c44]
module.networking.aws_route.private_nat: Refreshing state... [id=r-rtb-007b1826a1715b5da1080289494]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.networking.aws_instance.nat has been deleted
  - resource "aws_instance" "nat" {
      - id                                   = "i-0e578444c61e7ceeb" -> null
      - primary_network_interface_id         = "eni-0e30b2810f121bb28" -> null
        tags                                 = {
            "AutoStop" = "false"
            "Name"     = "doktori-nonprod-nat"
            "Service"  = "nat"
        }
        # (32 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.networking.aws_eip_association.nat will be created
  + resource "aws_eip_association" "nat" {
      + allocation_id        = "eipalloc-062b606ffff92b459"
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip_address   = (known after apply)
      + public_ip            = (known after apply)
    }

  # module.networking.aws_instance.nat will be created
  + resource "aws_instance" "nat" {
      + ami                                  = "ami-05d7ff9706f910b7d"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t4g.nano"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "doktori-dev"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = false
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-05621a464006280c3"
      + tags                                 = {
          + "AutoStop" = "false"
          + "Name"     = "doktori-nonprod-nat"
          + "Service"  = "nat"
        }
      + tags_all                             = {
          + "AutoStop"    = "false"
          + "Environment" = "nonprod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "doktori-nonprod-nat"
          + "Project"     = "doktori"
          + "Service"     = "nat"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "d49ebb9e646c9e2fc2ce3cbe7969d1b4203c51ea"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-0a212a3070298e3e9",
        ]

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = "required"
          + instance_metadata_tags      = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = true
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 8
          + volume_type           = "gp3"
        }
    }

  # module.networking.aws_route.private_nat will be updated in-place
  ~ resource "aws_route" "private_nat" {
        id                     = "r-rtb-007b1826a1715b5da1080289494"
      ~ network_interface_id   = "eni-0e4d23d6649668c49" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.networking.aws_route53_zone.internal will be created
  + resource "aws_route53_zone" "internal" {
      + arn                 = (known after apply)
      + comment             = "Managed by Terraform"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "dev.doktori.internal"
      + name_servers        = (known after apply)
      + primary_name_server = (known after apply)
      + tags                = {
          + "Name" = "dev.doktori.internal"
        }
      + tags_all            = {
          + "Environment" = "nonprod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "dev.doktori.internal"
          + "Project"     = "doktori"
        }
      + zone_id             = (known after apply)

      + vpc {
          + vpc_id     = "vpc-0d77fef37669dc1c0"
          + vpc_region = (known after apply)
        }
    }

  # module.networking.aws_security_group.nat will be updated in-place
  ~ resource "aws_security_group" "nat" {
        id                     = "sg-0a212a3070298e3e9"
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 51820
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "udp"
              - security_groups  = []
              - self             = false
              - to_port          = 51820
            },
            # (1 unchanged element hidden)
        ]
        name                   = "doktori-nonprod-nat-20260218084308755700000001"
        tags                   = {
            "Name" = "doktori-nonprod-nat-sg"
        }
        # (8 unchanged attributes hidden)
    }

Plan: 3 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  ~ networking = {
      + internal_zone_id   = (known after apply)
      + internal_zone_name = "dev.doktori.internal"
        # (6 unchanged attributes hidden)
    }

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```